BAS BMEKZU Project/src/ChartsOfCalculationTypes/ИНАГРО_ВзносыВФонды/ИНАГРО_ВзносыВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ИНАГРО_ВзносыВФонды</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ИНАГРО_Начисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Безработица20050101</name>
      <description>Безработица (работник 20050101)</description>
    </items>
    <items>
      <name>БезработицаФОТ20050101</name>
      <description>Безработица (ФОТ 20050101)</description>
    </items>
    <items>
      <name>ЕСВБольничные</name>
      <description>ЕСВ (больничные)</description>
    </items>
    <items>
      <name>ЕСВМобилизованные</name>
      <description>ЕСВ (мобилизованные)</description>
    </items>
    <items>
      <name>ЕСВ</name>
      <description>ЕСВ (оплата труда)</description>
    </items>
    <items>
      <name>ЕСВДекретные</name>
      <description>ЕСВ (по беременности и родам)</description>
    </items>
    <items>
      <name>ЕСВГПХ</name>
      <description>ЕСВ по договорам ГПХ</description>
    </items>
    <items>
      <name>ЕСВФОТБольничные</name>
      <description>ЕСВ ФОТ (больничные)</description>
    </items>
    <items>
      <name>ЕСВФОТМобилизованные</name>
      <description>ЕСВ ФОТ (мобилизованные)</description>
    </items>
    <items>
      <name>ЕСВФОТ</name>
      <description>ЕСВ ФОТ (оплата труда)</description>
    </items>
    <items>
      <name>ЕСВФОТДекретные</name>
      <description>ЕСВ ФОТ (по беременности и родам)</description>
    </items>
    <items>
      <name>ЕСВФОТГПХ</name>
      <description>ЕСВ ФОТ (по договорам ГПХ)</description>
    </items>
    <items>
      <name>НДФЛ_Пересчет</name>
      <description>НДФЛ (для перерасчета)</description>
    </items>
    <items>
      <name>Пенсионный20050101</name>
      <description>Пенсионный (работник 20050101)</description>
    </items>
    <items>
      <name>Пенсионный20070101</name>
      <description>Пенсионный (работник 20070101)</description>
    </items>
    <items>
      <name>ПенсионныйФОТ20050101</name>
      <description>Пенсионный (ФОТ 20050101)</description>
    </items>
    <items>
      <name>Соцстрах20050101</name>
      <description>Соцстрах (работник 20050101)</description>
    </items>
    <items>
      <name>СоцстрахФОТ20050101</name>
      <description>Соцстрах (ФОТ 20050101)</description>
    </items>
    <items>
      <name>СоцстрахНесчФОТ20050101</name>
      <description>Соцстрах от несч. сл.(ФОТ 20050101)</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаНачислений</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаПоШкале</name>
    <type>
      <types>EnumRef.СпособыРасчетаПоШкале</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасчета</name>
    <type>
      <types>EnumRef.КатегорииРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаПоПериодуРегистрации</name>
    <comment>Алгоритм расчета взносов по ставке на период регистрации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

BAS BMEKZU Project/src/Enums/КатегорииРасчетов/КатегорииРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииРасчетов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>Первичное</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ЗависимоеПервогоУровня</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ЗависимоеВторогоУровня</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ЗависимоеТретьегоУровня</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/СпособыРасчетаНачислений/СпособыРасчетаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаНачислений</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоДням</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоДневнойТарифнойСтавке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойТарифнойСтавке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ИндексацияЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДоплатаДоМинЗП</name>
  </enumValues>
  <enumValues>
    <name>ИндексацияСоциальныхНачислений</name>
  </enumValues>
  <enumValues>
    <name>НулеваяСумма</name>
  </enumValues>
  <enumValues>
    <name>ВзносыФОТ</name>
    <comment>Взносы, которые перечисляет организация на ФОТ</comment>
  </enumValues>
  <enumValues>
    <name>Взносы</name>
    <comment>Взносы, которые перечисляются работниками</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
  </enumValues>
  <enumValues>
    <name>Замена</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуФСС</name>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляКомпенсацииОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистФиксСуммой</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистФиксСуммойДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентом</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентомДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыФиксСуммой</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыФиксСуммойДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыПроцентом</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>АлиментыПроцентомДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПочтовыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистСУчетомОграничения</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаВечерниеЧасы</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаНочныеЧасы</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговоруФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФормула</name>
  </enumValues>
  <enumValues>
    <name>КомпенсацияНевыплаченнойЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ИндексацияАлиментов</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоМЗП</name>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойТарифнойСтавкеУмножитьНаПроцент</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/ChartsOfCalculationTypes/ИНАГРО_ВзносыВФонды/Forms/ФормаВидаРасчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.КатегорияРасчета = Перечисления.КатегорииРасчетов.Первичное;
		Объект.СпособРасчета = Перечисления.СпособыРасчетаНачислений.Взносы;
	КонецЕсли;
	
	Элементы.ВедущиеВидыРасчетаВидРасчета.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовРасчетаСсылка.ИНАГРО_Начисления");
	
	ВыполнитьЧтениеНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ВыполнитьЧтениеНаСервере();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЕСВПриИзменении(Элемент)
	
	Если Объект.ЕСВ Тогда
		Объект.СтавкаПоПериодуРегистрации = Истина;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования,
		ЭтотОбъект,
		"Объект.Комментарий");
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицФормы

&НаКлиенте
Процедура БазовыеВидыРасчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	УдалениеВыбранныхВидовРасчета(ВыбранноеЗначение.УдаленныеВидыРасчета, Объект.БазовыеВидыРасчета);
	
	Для Каждого Значение Из ВыбранноеЗначение.ДобавленныеВидыРасчета Цикл
		ОбработкаВыбранногоНачисления(Значение, Объект.БазовыеВидыРасчета, "БазовыеВидыРасчета");
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборБазовые(Команда)
	
	МассивВидовРасчета = ИНАГРО_РасчетЗарплатыРасширенныйКлиентСервер.ВидыРасчетаКоллекции(Объект.БазовыеВидыРасчета);
	ПараметрыФормы = Новый Структура("МассивВидовРасчета", МассивВидовРасчета);
	ОткрытьФорму("ОбщаяФорма.ИНАГРО_ПодборВидовРасчета", ПараметрыФормы, Элементы.БазовыеВидыРасчета);

КонецПроцедуры

&НаКлиенте
Процедура ПодборВедущие(Команда)
	
	МассивВидовРасчета = ИНАГРО_РасчетЗарплатыРасширенныйКлиентСервер.ВидыРасчетаКоллекции(Объект.ВедущиеВидыРасчета);
	ПараметрыФормы = Новый Структура("МассивВидовРасчета", МассивВидовРасчета);
	ОткрытьФорму("ОбщаяФорма.ИНАГРО_ПодборВидовРасчета", ПараметрыФормы, Элементы.ВедущиеВидыРасчета);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьЧтениеНаСервере(ТекущийОбъект = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = Объект;
	КонецЕсли;
	
	УстановитьДоступность(ЭтаФорма);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(Форма)
	
	Форма.Элементы.СпособРасчета.ТолькоПросмотр = Форма.Объект.Предопределенный;
	Форма.Элементы.СпособРасчетаПоШкале.ТолькоПросмотр = Форма.Объект.Предопределенный;
	Форма.Элементы.ЕСВ.ТолькоПросмотр = Форма.Объект.Предопределенный;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбранногоНачисления(Значение, ТаблицаВидовРасчета, ИмяТаблицы)
	
	Если ТаблицаВидовРасчета.НайтиСтроки(Новый Структура("ВидРасчета", Значение)).Количество() = 0 Тогда
		ТаблицаВидовРасчета.Добавить().ВидРасчета = Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВедущиеВидыРасчетаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	УдалениеВыбранныхВидовРасчета(ВыбранноеЗначение.УдаленныеВидыРасчета, Объект.ВедущиеВидыРасчета);
	
	Для Каждого Значение Из ВыбранноеЗначение.ДобавленныеВидыРасчета Цикл
		ОбработкаВыбранногоНачисления(Значение, Объект.ВедущиеВидыРасчета, "ВедущиеВидыРасчета");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УдалениеВыбранныхВидовРасчета(УдаленныеВидыРасчета, ТаблицаВидовРасчета)
	
	Для Каждого Значение Из УдаленныеВидыРасчета Цикл
		СтрокиДляУдаления = ТаблицаВидовРасчета.НайтиСтроки(Новый Структура("ВидРасчета", Значение));
		Для Каждого ТекСтрока Из СтрокиДляУдаления Цикл 
			ТаблицаВидовРасчета.Удалить(ТекСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти
